IDEA Open Model
Region2D.Openings Property
Compatible with IDEA StatiCa Beta 20.0
 Gets or sets the list of openings in the Region2D.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public List<PolyLine2D> Openings { get; set; }
Public Property Openings As List(Of PolyLine2D)
	Get
	Set
Property Value
Type: List<PolyLine2D>
See Also
Reference
Region2D Class
IdeaRS.OpenModel.Geometry2D Namespace